app/controllers/produkt_katalog_controller.rb

SELECT "parts".* FROM "parts" WHERE (id LIKE 'addinput')
---
  def index
    @indexresult =  Parts.all

SELECT "parts".* FROM "parts" WHERE (name LIKE '%re%')
---
  def search
  	searchinput = params[:searchinput]

  	@searchresult = Parts.where("name LIKE '%#{searchinput}%'")